{
    "teams": {
        "ANA": [
            "One Cup in '07? Anaheim, you're more likely to see Mickey Mouse score a hat trick than lift another.",
            "Your last Cup's so old, it's probably chilling with Donald Duck at Disneyland."
        ],
        "BOS": [
            "2011 was a fluke, Boston. Now you're just loud fans with empty trophy cases.",
            "Bruins? More like Bruise-your-ego with that decade-plus Cup drought."
        ],
        "BUF": [
            "No cup in 55 years? Fans are drowning their sorrows in wings and overpriced beer.",
            "Trophy case has been repurposed as broom closet."
        ],
        "CGY": [
            "You last cup still wears a jeans jacket and a mullet.",
            "Good thing the Stampede's still happening."
        ],
        "CAR": [
            "2006 was cute.",
            "Hurricane? More like light breeze."
        ],
        "CHI": [
            "Three cups in 6 years, then nothing? Your dynasty's deader than disco."
        ],
        "COL": [
            "Just another Denver team no one cares about"
        ],
        "CBJ": [
            "Easy on the cannon pal, I think the players are frightened to score."
        ],
        "DAL": [
            "Stars? More like black holes",
            "Last cup was on dial-up"
        ],
        "DET": [
            "Cup dreams shut down faster than a Detroit car factory.",
            "Red wings? More like clipped wings."
        ],
        "EDM": [
            "McDavid's a beast but he'd need that 80's cocaine you guys has back in the day.",
            "Most fans are still wearing Gretzky jerseys."
        ],
        "FLA": [
            "Congratulations, two cups in a row. Don't get fooled though, Miami's still more into spring break than hockey."
        ],
        "LAK": [
            "Stick to Hollywood."
        ],
        "MIN": [
            "Fans are going wild trying to get reimbursment for their season passes.",
            "Wild? More like mild."
        ],
        "MTL": [
            "You guys are great and can do no wrong",
            "That rebuild is going to kick in this year.",
            "25!!!!",
            "GO HABS GO",
            "OLÉ OLÉ OLÉ OLÉ"
        ],
        "NSH": [
            "Put some blades under them cowboy boots maybe?",
            "Just another country song. All heart, no hardware, and a whole lot of whining."
        ],
        "NJD": [
            "Thank god for Martin Brodeur"
        ],
        "NYI": [
            "Yeah, it's the other New York team."
        ],
        "NYR": [
            "All the good players couldn't make it. They're stuck in a Manhattan traffic jam."
        ],
        "OTT": [
            "\"They won in 1927\", sighed the old man."
        ],
        "PHI": [
            "Remember the '70s?",
            "It's been a while since the Broad Street Bullies"
        ],
        "PIT": [
            "Mario Lemiwho?",
            "Crosby's tired now."
        ],
        "SJS": [
            "Ever heard of a toothless shark?",
            "Been circling the cup for 30 but still can't bite it"
        ],
        "SEA": [
            "Fancy arena. Overpriced merch.",
            "More like Seattle Slackin'"
        ],
        "STL": [
            "Another sad blues song",
            "Does Brett Hull still play there?"
        ],
        "TBL": [],
        "TOR": [
            "58 years and counting, Toronto. Your Cup drought's older than your grandma's skates.",
            "Leafs Nation? More like Leafs Desperation. The Cup's allergic to blue and white."
        ],
        "UTA": [],
        "VAN": [
            "Three Finals, zero Cups, and a riot to boot. Vancouver, you're the NHL's heartbreak kings.",
            "No Cup in 55 years? Canucks fans must be pros at crying into their sushi."
        ],
        "VGK": [
            "Gamblin' away championship shots",
            "Golden years already behind them"
        ],
        "WSH": [
            "I give you give a good two more years at championship contention. Ovi's on the Cheetos big time."
        ],
        "WPG": [
            "Are the jets ever going to take off?",
            "The hinges on the trophy case have to be frozen by now."
        ]
    },
    "thresholds": {
        "fresh": [
            "Fresh Cup? Don't get cocky—your team's already back to choking in the playoffs.",
            "Just won? Enjoy it, because the Cup's probably ghosting you for the next decade.",
            "Recent champs? Your Cup’s still shiny, but your team’s already tripping over its ego."
        ],
        "10_years": [
            "A decade without a Cup? Your fans are crying harder than your goalie after a shutout.",
            "Ten years and no hardware? Your rink's starting to smell like despair and stale beer.",
            "Over a decade gone? Your Cup's just a memory your fans drunk-dialed at 2 a.m."
        ],
        "20_years": [
            "Two decades of nothing? Your Cup dreams are older than your backup goalie's gear.",
            "20 years since a win? Your trophy case is lonelier than a penalty box in overtime.",
            "No Cup in 20 years? Your team's hopes are deader than a rink after a blowout."
        ],
        "30_years": [
            "30 years without a Cup? Your last win's on VHS, and your hopes are on life support.",
            "Mullets were in when you last won. Time to trade your dreams for a reality check.",
            "Three decades dry? Your Cup's so gone, it's probably retired in a museum."
        ],
        "50_years": [
            "Half a century drought? Your team's cursed worse than a haunted rink at midnight.",
            "50+ years? The Cup's so far gone, it's probably retired in Florida with your fans' hopes.",
            "Over 50 years without a Cup? Your team's legacy is just a sad footnote in NHL history."
        ],
        "never_won": [
            "Zero Cups? Your trophy case is emptier than a rink after a 10-0 blowout.",
            "Never won? Congrats, your team's the NHL's official doormat—better luck next century."
        ]
    }
}